/***********************************************************************************************
//CH_Kinetis驱动库  V2.3
//作者    :YANDLD 
//E-MAIL  :yandld@126.com
//修改日期:2013/2/14
//版本：V2.3
//淘宝：http://upcmcu.taobao.com
//QQ    1453363089
//Copyright(C) YANDLD 2012-2022
//All rights reserved
************************************************************************************************/
#include "wdog.h"
#include "sys.h"
/***********************************************************************************************
 功能：看门狗初始化
 形参：ms: 看门狗复位间隔时间 单位为ms  
 返回：0
 详解：看门狗初始化
************************************************************************************************/
void WDOG_Init(u16 ms)
{
	u32 Value;
	WDOG->UNLOCK=0xC520u;
	WDOG->UNLOCK=0xD928u;  //看门狗钥匙，参考k10手册504页。
	//在这里大部分选择默认配置,时钟来源为bus clock即48mhz
	WDOG->PRESC=WDOG_PRESC_PRESCVAL(7);//设置分频器，设置值为8，及不分频，参见手册506页
	Value=CPUInfo.BusClock/8;            //BusClock8分频
  Value=((Value/1000)*ms);
	WDOG->TOVALH=(Value&0xFFFF0000)>>16;
	WDOG->TOVALL=(Value&0x0000FFFF)>>0;
	WDOG->STCTRLH|=0x0001u;//开启看门狗，参考k10手册501页。
}
/***********************************************************************************************
 功能：关闭看门狗 
 形参：0
 返回：0
 详解：关闭看门狗 
************************************************************************************************/
void WDOG_Close(void)
{
	WDOG->UNLOCK=0xC520u;
	WDOG->UNLOCK=0xD928u;  //看门狗钥匙，参考k10手册504页。
	WDOG->STCTRLH&=~0x0001u;//关闭看门狗，参考k10手册501页。
}
/***********************************************************************************************
 功能：开启看门狗
 形参：0
 返回：0
 详解：开启看门狗
************************************************************************************************/
void WDOG_Open(void)
{
	WDOG->UNLOCK=0xC520u;
	WDOG->UNLOCK=0xD928u;  //看门狗钥匙，参考k10手册504页。
	WDOG->STCTRLH|=0x0001u;//打开看门狗，参考k10手册501页。
}
/***********************************************************************************************
 功能：看门狗喂狗
 形参：0
 返回：0
 详解：看门狗喂狗
************************************************************************************************/
void WDOG_Feed(void)
{
	WDOG->REFRESH=0xA602u; 
	WDOG->REFRESH=0xB480u; //喂看门狗，参考k10手册504页。
}
